import { Component } from '@angular/core';
import { CommonModule } from '@angular/common';
import {
  animate,
  state,
  style,
  transition,
  trigger,
} from '@angular/animations';
import { svg } from '@interfaces/pictures-map';

export interface FAQ {
  title: string;
  text: string;
}

const expandAnimation = [
  trigger('expandItem', [
    state('collapsed', style({ height: '0', visibility: 'hidden' })),
    state('expanded', style({ height: 'auto', visibility: 'visible' })),
    transition('collapsed => expanded', animate('.08s ease-in')),
    transition('expanded => collapsed', animate('.08s ease-out')),
  ]),
  trigger('rotateItem', [
    state('rotated', style({})),
    state('rotate', style({ transform: 'rotate(-90deg)' })),
    transition('rotated => rotate', animate('.08s ease-in')),
    transition('rotate => rotated', animate('.08s ease-out')),
  ]),
];

@Component({
  selector: 'app-faq',
  standalone: true,
  imports: [CommonModule],
  templateUrl: './faq.component.html',
  styleUrls: ['./faq.component.scss'],
  animations: expandAnimation,
})
export class FaqComponent {
  svg = svg;

  faq: FAQ[] = [
    {
      title:
        'ЩО РОБИТИ, ЯКЩО ТОВАР НЕ ПІДІЙШОВ ЗА ФОРМОЮ, КОЛЬОРУ АБО РОЗМІРОМ І ІНШІ ПРИЧИНИ? ',
      text: "Протягом 14 днів від дати придбання товару (не рахуючи дати придбання) - Ви можете товар, який не використовувався, збережено товарний вигляд і споживчі властивості, і відсутня в переліку товарів, що не підлягають обміну або поверненню: Обміняти на аналогічний без перерахунку вартості; Обміняти на будь-який інший з відповідним перерахуванням вартості; Повернути і отримати сплачені за нього кошти. Як оцінити збереження товарного вигляду: При хорошому освітленні, без застосування спеціальних засобів, на товарі не повинно бути видимих ​​слідів користування у вигляді дрібних подряпин, потертостей, а тим більше відколів, вм'ятин або тріщин. Найпростіше оцінити збережений чи товарний вигляд, відповівши собі на питання: «Купив би я цей товар в такому вигляді, як новий?",
    },
    {
      title: 'ЯКА ГАРАНТІЯ У МОГО ТОВАРУ? ',
      text: "Протягом 14 днів від дати придбання товару (не рахуючи дати придбання) - Ви можете товар, який не використовувався, збережено товарний вигляд і споживчі властивості, і відсутня в переліку товарів, що не підлягають обміну або поверненню: Обміняти на аналогічний без перерахунку вартості; Обміняти на будь-який інший з відповідним перерахуванням вартості; Повернути і отримати сплачені за нього кошти. Як оцінити збереження товарного вигляду: При хорошому освітленні, без застосування спеціальних засобів, на товарі не повинно бути видимих ​​слідів користування у вигляді дрібних подряпин, потертостей, а тим більше відколів, вм'ятин або тріщин. Найпростіше оцінити збережений чи товарний вигляд, відповівши собі на питання: «Купив би я цей товар в такому вигляді, як новий?",
    },
    {
      title: 'ЧИ ЗДІЙСНЮЄТЕ ВИ ДОСТАВКУ ДО КВАРТИРИ І ПІДЙОМ НА ПОВЕРХ?',
      text: "Протягом 14 днів від дати придбання товару (не рахуючи дати придбання) - Ви можете товар, який не використовувався, збережено товарний вигляд і споживчі властивості, і відсутня в переліку товарів, що не підлягають обміну або поверненню: Обміняти на аналогічний без перерахунку вартості; Обміняти на будь-який інший з відповідним перерахуванням вартості; Повернути і отримати сплачені за нього кошти. Як оцінити збереження товарного вигляду: При хорошому освітленні, без застосування спеціальних засобів, на товарі не повинно бути видимих ​​слідів користування у вигляді дрібних подряпин, потертостей, а тим більше відколів, вм'ятин або тріщин. Найпростіше оцінити збережений чи товарний вигляд, відповівши собі на питання: «Купив би я цей товар в такому вигляді, як новий?",
    },
  ];

  public expandedIndex: number | null = null;

  toggle(i: number) {
    if (this.expandedIndex === i) {
      this.expandedIndex = null;
    } else {
      this.expandedIndex = i;
    }
  }

  isExpanded(i: number): boolean {
    return this.expandedIndex === i;
  }

  isRotate(i: number): boolean {
    return this.expandedIndex === i;
  }
}
